# Итоговая проверочная работа.

## Условие задачи

1. Создать репозиторий на **GitHub**.
2. Нарисовать блок-схему алгоритма (_можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод_).
3. Снабдить репозиторий оформленным текстовым описанием решения (файл **README.md**).
4. Написать программу, решающую поставленную задачу.
5. Использовать контроль версий в работе над этим небольшим проектом (_не должно быть так, что всё залито одним коммитом, как минимум этапы **2**, **3**, и **4** должны быть расположены в разных коммитах_)

## Задача:
* Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

# Решение:
* Создали репозиторий <https://github.com/TrushinAlexe/Examination>.
* Сделал блок-схему алгоритма и добавил ее комит плюс файл **Блоксхема**

# Описание решения
Сначало объявляется два массива: исходный и вторый такой же длины. Потом добавляем метод, в котором цикл соразмерный длине массива, внутри цикла проверка условия ( <=3 ), если да элемент первого массива заносится в count элемент второго массива. После присвоения увеличивается переменная count на 1 и возвращается к циклу for в котором i увеличивается на 1. И так проверяем до конца.

# Программа
```
string[] array1 = new string[5] {"student", "geekbrains", "1995", "525", "res"};
string[] array2 = new string[array1.Length];

void SecondArray(string[] array1, string[] array2)
{
    int count = 0;
    for (int i = 0; i < array1.Length; i++)
    {
    if(array1[i].Length <= 3)
        {
        array2[count] = array1[i];
        count++;
        }
    }
}
void PrintArray(string[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"{array[i]} ");
    }
    Console.WriteLine();
}
SecondArray(array1, array2);
PrintArray(array2);
```
# Контроль версий
* Так же было добавлено много коммитов и ветки. В которых так же вносились изменения. По мимо коммитов, было слияние веток, и внесения изменений через удаленный репозиторий.
